In [1]:
%load_ext sql
%sql mysql+pymysql://root:root@localhost:3306

In [2]:
%%sql

create database aviation_db;

 * mysql+pymysql://root:***@localhost:3306
1 rows affected.

[]

In [3]:
%%sql

use aviation_db;

 * mysql+pymysql://root:***@localhost:3306
0 rows affected.

[]

In [4]:
%%sql

create table flight_data(id serial primary key,airline_name varchar(100),departure_airport varchar(100),terminal integer,departure_time datetime,
                         flight_date date,flight_status varchar(50),arrival_airport varchar(100),arrival_terminal integer,arrival_time datetime);

 * mysql+pymysql://root:***@localhost:3306
0 rows affected.

[]

In [22]:
%%sql

select * from flight_data
limit 5;

 * mysql+pymysql://root:***@localhost:3306
5 rows affected.

[(1, 'Emirates', 'Haneda Airport', 3, datetime.datetime(2025, 7, 3, 5, 35), datetime.date(2025, 7, 3), 'scheduled', 'Dubai', 3, datetime.datetime(2025, 7, 3, 11, 15)),
 (2, 'Emirates', 'Singapore Changi', 1, datetime.datetime(2025, 7, 3, 6, 20), datetime.date(2025, 7, 3), 'scheduled', 'Dubai', 3, datetime.datetime(2025, 7, 3, 9, 45)),
 (3, 'Emirates', 'Brisbane International', 1, datetime.datetime(2025, 7, 3, 7, 25), datetime.date(2025, 7, 3), 'scheduled', 'Dubai', 3, datetime.datetime(2025, 7, 3, 15, 35)),
 (4, 'TAP Air Portugal', 'Hong Kong International', 1, datetime.datetime(2025, 7, 3, 6, 10), datetime.date(2025, 7, 3), 'active', 'Dubai', 3, datetime.datetime(2025, 7, 3, 9, 55)),
 (5, 'Emirates', 'Hong Kong International', 1, datetime.datetime(2025, 7, 3, 6, 10), datetime.date(2025, 7, 3), 'active', 'Dubai', 3, datetime.datetime(2025, 7, 3, 9, 55))]

In [8]:
%%sql

truncate table flight_data;

 * mysql+pymysql://root:***@localhost:3306
0 rows affected.

[]

In [4]:
%%sql

select * from flight_data
limit 5;

 * mysql+pymysql://root:***@localhost:3306
5 rows affected.

[(1, 'Emirates', 'Haneda Airport', 3, datetime.datetime(2025, 7, 3, 5, 35), datetime.date(2025, 7, 3), 'scheduled', 'Dubai', 3, datetime.datetime(2025, 7, 3, 11, 15)),
 (2, 'Emirates', 'Singapore Changi', 1, datetime.datetime(2025, 7, 3, 6, 20), datetime.date(2025, 7, 3), 'scheduled', 'Dubai', 3, datetime.datetime(2025, 7, 3, 9, 45)),
 (3, 'Emirates', 'Brisbane International', 1, datetime.datetime(2025, 7, 3, 7, 25), datetime.date(2025, 7, 3), 'scheduled', 'Dubai', 3, datetime.datetime(2025, 7, 3, 15, 35)),
 (4, 'TAP Air Portugal', 'Hong Kong International', 1, datetime.datetime(2025, 7, 3, 6, 10), datetime.date(2025, 7, 3), 'active', 'Dubai', 3, datetime.datetime(2025, 7, 3, 9, 55)),
 (5, 'Emirates', 'Hong Kong International', 1, datetime.datetime(2025, 7, 3, 6, 10), datetime.date(2025, 7, 3), 'active', 'Dubai', 3, datetime.datetime(2025, 7, 3, 9, 55))]

In [13]:
%%sql

# Flights Travel time

select id,departure_airport,arrival_airport, timediff(arrival_time,departure_time) as Travel_time from flight_data
limit 5;

 * mysql+pymysql://root:***@localhost:3306
5 rows affected.

[(1, 'Haneda Airport', 'Dubai', datetime.timedelta(seconds=20400)),
 (2, 'Singapore Changi', 'Dubai', datetime.timedelta(seconds=12300)),
 (3, 'Brisbane International', 'Dubai', datetime.timedelta(seconds=29400)),
 (4, 'Hong Kong International', 'Dubai', datetime.timedelta(seconds=13500)),
 (5, 'Hong Kong International', 'Dubai', datetime.timedelta(seconds=13500))]

In [21]:
%%sql
#  Flights Operated by Emirates
select * from flight_data
where airline_name = 'Emirates'
limit 5;

 * mysql+pymysql://root:***@localhost:3306
5 rows affected.

[(1, 'Emirates', 'Haneda Airport', 3, datetime.datetime(2025, 7, 3, 5, 35), datetime.date(2025, 7, 3), 'scheduled', 'Dubai', 3, datetime.datetime(2025, 7, 3, 11, 15)),
 (2, 'Emirates', 'Singapore Changi', 1, datetime.datetime(2025, 7, 3, 6, 20), datetime.date(2025, 7, 3), 'scheduled', 'Dubai', 3, datetime.datetime(2025, 7, 3, 9, 45)),
 (3, 'Emirates', 'Brisbane International', 1, datetime.datetime(2025, 7, 3, 7, 25), datetime.date(2025, 7, 3), 'scheduled', 'Dubai', 3, datetime.datetime(2025, 7, 3, 15, 35)),
 (5, 'Emirates', 'Hong Kong International', 1, datetime.datetime(2025, 7, 3, 6, 10), datetime.date(2025, 7, 3), 'active', 'Dubai', 3, datetime.datetime(2025, 7, 3, 9, 55)),
 (6, 'Emirates', 'Singapore Changi', 1, datetime.datetime(2025, 7, 3, 7, 10), datetime.date(2025, 7, 3), 'scheduled', 'Dubai', 3, datetime.datetime(2025, 7, 3, 10, 25))]

In [15]:
%%sql
# Count of Flights Per Airline
select airline_name,count(*) as count_of_flights from flight_data
group by airline_name;

 * mysql+pymysql://root:***@localhost:3306
25 rows affected.

[('Emirates', 41),
 ('TAP Air Portugal', 4),
 ('China Southern Airlines', 1),
 ('Japan Airlines', 1),
 ('Air Canada', 2),
 ('Condor', 2),
 ('Gulf Air', 1),
 ('Alitalia', 3),
 ('Qantas', 4),
 ('flydubai', 20),
 ('SpiceJet', 1),
 ('IndiGo', 3),
 ('Air France', 1),
 ('Saudia', 1),
 ('Garuda Indonesia', 2),
 ('Air Baltic', 2),
 ('Air India', 1),
 ('Air India Express', 2),
 ('Pakistan International Airlines', 2),
 ('flynas', 1),
 ('Airblue', 1),
 ('Turkish Airlines', 1),
 ('Air Mauritius', 1),
 ('RwandAir', 1),
 ('United Airlines', 1)]

In [17]:
%%sql
#  Flights on a Specific Date (e.g. July 3)
select * from flight_data
where day(flight_date) = 3 and month(flight_date) = 7
limit 5;

 * mysql+pymysql://root:***@localhost:3306
5 rows affected.

[(1, 'Emirates', 'Haneda Airport', 3, datetime.datetime(2025, 7, 3, 5, 35), datetime.date(2025, 7, 3), 'scheduled', 'Dubai', 3, datetime.datetime(2025, 7, 3, 11, 15)),
 (2, 'Emirates', 'Singapore Changi', 1, datetime.datetime(2025, 7, 3, 6, 20), datetime.date(2025, 7, 3), 'scheduled', 'Dubai', 3, datetime.datetime(2025, 7, 3, 9, 45)),
 (3, 'Emirates', 'Brisbane International', 1, datetime.datetime(2025, 7, 3, 7, 25), datetime.date(2025, 7, 3), 'scheduled', 'Dubai', 3, datetime.datetime(2025, 7, 3, 15, 35)),
 (4, 'TAP Air Portugal', 'Hong Kong International', 1, datetime.datetime(2025, 7, 3, 6, 10), datetime.date(2025, 7, 3), 'active', 'Dubai', 3, datetime.datetime(2025, 7, 3, 9, 55)),
 (5, 'Emirates', 'Hong Kong International', 1, datetime.datetime(2025, 7, 3, 6, 10), datetime.date(2025, 7, 3), 'active', 'Dubai', 3, datetime.datetime(2025, 7, 3, 9, 55))]

In [20]:
%%sql

#  Top 5 Busiest Departure Airports

select departure_airport,count(*) as airports_counts from flight_data
group by departure_airport
order by airports_counts desc
limit 5;

 * mysql+pymysql://root:***@localhost:3306
5 rows affected.

[('Seeb', 6),
 ('Noibai International', 5),
 ('King Abdulaziz International', 5),
 ('Melbourne - Tullamarine Airport', 4),
 ('Suvarnabhumi International', 4)]

In [23]:
%%sql

#  Most Common Arrival Airport

select arrival_airport,count(*) as airport_count from flight_data
group by arrival_airport
order by airport_count desc
limit 5;

 * mysql+pymysql://root:***@localhost:3306
1 rows affected.

[('Dubai', 100)]

In [25]:
%%sql

#  Flights with active Status

select id,airline_name ,departure_airport,terminal,departure_time,flight_date,flight_status from flight_data
where flight_status = 'active';

 * mysql+pymysql://root:***@localhost:3306
9 rows affected.

[(4, 'TAP Air Portugal', 'Hong Kong International', 1, datetime.datetime(2025, 7, 3, 6, 10), datetime.date(2025, 7, 3), 'active'),
 (5, 'Emirates', 'Hong Kong International', 1, datetime.datetime(2025, 7, 3, 6, 10), datetime.date(2025, 7, 3), 'active'),
 (7, 'China Southern Airlines', 'Guangzhou Baiyun International', 1, datetime.datetime(2025, 7, 3, 5, 45), datetime.date(2025, 7, 3), 'active'),
 (8, 'Emirates', 'Guangzhou Baiyun International', 1, datetime.datetime(2025, 7, 3, 5, 45), datetime.date(2025, 7, 3), 'active'),
 (10, 'Japan Airlines', 'Haneda Airport', 3, datetime.datetime(2025, 7, 3, 5, 35), datetime.date(2025, 7, 3), 'active'),
 (35, 'Air Baltic', 'Soekarno-Hatta International', 3, datetime.datetime(2025, 7, 3, 6, 15), datetime.date(2025, 7, 3), 'active'),
 (36, 'flydubai', 'Soekarno-Hatta International', 3, datetime.datetime(2025, 7, 3, 6, 15), datetime.date(2025, 7, 3), 'active'),
 (37, 'Garuda Indonesia', 'Soekarno-Hatta International', 3, datetime.datetime(2025, 7, 3, 6, 15), datetime.date(2025, 7, 3), 'active'),
 (39, 'Air India', 'Goa International', 1, datetime.datetime(2025, 7, 3, 6, 30), datetime.date(2025, 7, 3), 'active')]

In [41]:
%%sql
#   Earliest Departure Each Day

select flight_date,min(time(departure_time)) as early_flight  from flight_data
group by flight_date
limit 5;

 * mysql+pymysql://root:***@localhost:3306
1 rows affected.

[(datetime.date(2025, 7, 3), datetime.timedelta(seconds=20100))]

In [33]:
%%sql

#  Flights Missing Arrival Airport

select * from flight_data
where arrival_airport ='unknown'
limit 5;

 * mysql+pymysql://root:***@localhost:3306
0 rows affected.

[]

In [34]:
%%sql

#  Flight status except scheduled and active

select * from flight_data
where flight_status not in('scheduled','active')
limit 5;

 * mysql+pymysql://root:***@localhost:3306
1 rows affected.

[(49, 'flydubai', 'Heydar Aliyev International (Bina International)', 1, datetime.datetime(2025, 7, 3, 5, 40), datetime.date(2025, 7, 3), 'cancelled', 'Dubai', 2, datetime.datetime(2025, 7, 3, 8, 35))]

In [35]:
%%sql

#  Total Flights Per Day

select flight_date ,count(*) as flight_counts from flight_data
group by flight_date;

 * mysql+pymysql://root:***@localhost:3306
1 rows affected.

[(datetime.date(2025, 7, 3), 100)]

In [42]:
%%sql

# Last Flight in a day

select flight_date,max(time(departure_time)) as last_flight  from flight_data
group by flight_date
limit 5;

 * mysql+pymysql://root:***@localhost:3306
1 rows affected.

[(datetime.date(2025, 7, 3), datetime.timedelta(seconds=47700))]